In [2]:
!pip install pandas

Requirement already satisfied: pandas in d:\machinelearning\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in d:\machinelearning\venv\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\machinelearning\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\machinelearning\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in d:\machinelearning\venv\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in d:\machinelearning\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [5]:
data = [1,2,3,4,5,6]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
## series from dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data);
series_dict

a    1
b    2
c    3
dtype: int64

In [9]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

### Dataframe

In [8]:
data = {
    "name":["grins","alpha","beta"],
    "age":["18","25","23"],
    "city":["pune","bangalor","florida"]    
}
df = pd.DataFrame(data);
print(df)
print(type(df))

    name age      city
0  grins  18      pune
1  alpha  25  bangalor
2   beta  23   florida
<class 'pandas.core.frame.DataFrame'>

In [28]:
## dataframe from list of dictionary
df = pd.read_csv("sales_data.csv");
print(df.head(5))

         date     product     category   price  quantity  revenue
0  2022-01-01  Smartphone  Electronics   600.0      10.0   6000.0
1  2022-01-01      Laptop  Electronics  1200.0       5.0   6000.0
2  2022-01-02     T-Shirt     Clothing    20.0      50.0   1000.0
3  2022-01-03  Headphones  Electronics   100.0      20.0   2000.0
4  2022-01-04     T-Shirt     Clothing    20.0      25.0    500.0

In [9]:
df

    name age      city
0  grins  18      pune
1  alpha  25  bangalor
2   beta  23   florida

In [16]:
df.loc[0]
df.iloc[0][2]

C:\Users\grins\AppData\Local\Temp\ipykernel_4364\2519180099.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'pune'

In [21]:
df.at[2,'age']

'23'

In [23]:
df.iat[1,2]

'bangalor'

In [24]:
df

    name age      city
0  grins  18      pune
1  alpha  25  bangalor
2   beta  23   florida

In [26]:
df['salary']=[50000,60000,70000]
df

    name age      city  salary
0  grins  18      pune   50000
1  alpha  25  bangalor   60000
2   beta  23   florida   70000

In [27]:
# remove salary
# axis set to column axis = 1 => column and axis = 0 (default) => rows
df.drop('salary',axis=1)
df.drop('salary',axis=1,inplace=True)

    name age      city
0  grins  18      pune
1  alpha  25  bangalor
2   beta  23   florida

In [ ]:
df['age']= df

In [30]:
print(df.describe())

             price    quantity      revenue
count   367.000000  368.000000   368.000000
mean    211.226158   14.565217  2060.679348
std     227.335170    8.595740  1910.930790
min      20.000000    3.000000   300.000000
25%      50.000000    8.000000   800.000000
50%     100.000000   12.000000  1200.000000
75%     300.000000   20.000000  2400.000000
max    1200.000000   50.000000  7200.000000

In [31]:
print(df.head(10))

         date     product     category   price  quantity  revenue
0  2022-01-01  Smartphone  Electronics   600.0      10.0   6000.0
1  2022-01-01      Laptop  Electronics  1200.0       5.0   6000.0
2  2022-01-02     T-Shirt     Clothing    20.0      50.0   1000.0
3  2022-01-03  Headphones  Electronics   100.0      20.0   2000.0
4  2022-01-04     T-Shirt     Clothing    20.0      25.0    500.0
5  2022-01-05       Watch  Accessories   150.0      10.0   1500.0
6  2022-01-06  Smartphone  Electronics   600.0       8.0   4800.0
7  2022-01-06      Tablet  Electronics   400.0       5.0   2000.0
8  2022-01-07        Coat     Clothing   100.0      10.0   1000.0
9  2022-01-08  Smartwatch  Accessories   200.0      12.0   2400.0

In [32]:
df.dtypes

date         object
product      object
category     object
price       float64
quantity    float64
revenue     float64
dtype: object

In [36]:
df.isnull().any(axis = 0)

date        False
product     False
category    False
price        True
quantity     True
revenue      True
dtype: bool

In [40]:
### renaminf Colums
df = df.rename(columns={'date':"data chage"})
df["price_new"] = df['price'].fillna(df['price'].mean()).astype(int)
print(df)

     data chage     product     category   price  quantity  revenue  price_new
0    2022-01-01  Smartphone  Electronics   600.0      10.0   6000.0        600
1    2022-01-01      Laptop  Electronics  1200.0       5.0   6000.0       1200
2    2022-01-02     T-Shirt     Clothing    20.0      50.0   1000.0         20
3    2022-01-03  Headphones  Electronics   100.0      20.0   2000.0        100
4    2022-01-04     T-Shirt     Clothing    20.0      25.0    500.0         20
..          ...         ...          ...     ...       ...      ...        ...
364  2022-12-27       Watch  Accessories   150.0       5.0    750.0        150
365  2022-12-28        Coat     Clothing   100.0       5.0    500.0        100
366  2022-12-29  Headphones  Electronics   100.0      10.0   1000.0        100
367  2022-12-30  Smartphone  Electronics   600.0      11.0   6600.0        600
368  2022-12-31      Hoodie     Clothing    40.0      30.0   1200.0         40

[369 rows x 7 columns]

In [41]:
df['new_val'] = df['price'].apply(lambda x:x*2)
print(df)

     data chage     product     category   price  quantity  revenue  \
0    2022-01-01  Smartphone  Electronics   600.0      10.0   6000.0
1    2022-01-01      Laptop  Electronics  1200.0       5.0   6000.0
2    2022-01-02     T-Shirt     Clothing    20.0      50.0   1000.0
3    2022-01-03  Headphones  Electronics   100.0      20.0   2000.0
4    2022-01-04     T-Shirt     Clothing    20.0      25.0    500.0
..          ...         ...          ...     ...       ...      ...
364  2022-12-27       Watch  Accessories   150.0       5.0    750.0
365  2022-12-28        Coat     Clothing   100.0       5.0    500.0
366  2022-12-29  Headphones  Electronics   100.0      10.0   1000.0
367  2022-12-30  Smartphone  Electronics   600.0      11.0   6600.0
368  2022-12-31      Hoodie     Clothing    40.0      30.0   1200.0

     price_new  new_val
0          600   1200.0
1         1200   2400.0
2           20     40.0
3          100    200.0
4           20     40.0
..         ...      ...
364        150    300.0
365        100    200.0
366        100    200.0
367        600   1200.0
368         40     80.0

[369 rows x 8 columns]

In [ ]:
### data aggerating and Grouping

In [43]:
grouped_mean = df.groupby('product')['price'].mean()
print(grouped_mean)

product
Backpack        50.0
Coat           100.0
Headphones     100.0
Hoodie          40.0
Jeans           50.0
Laptop        1200.0
Smartphone     600.0
Smartwatch     200.0
Sneakers        80.0
Speaker         80.0
T-Shirt         20.0
Tablet         400.0
Wallet          30.0
Watch          150.0
Name: price, dtype: float64

In [44]:
df.groupby(['product','category'])['price'].mean()

product     category
Backpack    Bags             50.0
            Bgas             50.0
Coat        Clothing        100.0
Headphones  Electronics     100.0
Hoodie      Clohting         40.0
            Clothing         40.0
Jeans       Clothing         50.0
Laptop      Electronics    1200.0
Smartphone  Electronics     600.0
Smartwatch  Accessories     200.0
Sneakers    Shoes            80.0
            Shoeses          80.0
Speaker     Electronics      80.0
T-Shirt     Clothing         20.0
Tablet      Electronics     400.0
Wallet      Accessories      30.0
Watch       Accessories     150.0
Name: price, dtype: float64

In [55]:
df_agg= df.groupby(['product'])['price'].aggregate('mean','sum','count','std')
df_agg

product
Backpack        50.0
Coat           100.0
Headphones     100.0
Hoodie          40.0
Jeans           50.0
Laptop        1200.0
Smartphone     600.0
Smartwatch     200.0
Sneakers        80.0
Speaker         80.0
T-Shirt         20.0
Tablet         400.0
Wallet          30.0
Watch          150.0
Name: price, dtype: float64

In [57]:
df1 = pd.DataFrame({'key':[1,2,3],'value':["a",'b','c']})
df1

   key value
0    1     a
1    2     b
2    3     c

In [59]:
df2 = pd.DataFrame({'key':[1,2,4],'value':["a",'b','c']})
df2

   key value
0    1     a
1    2     b
2    4     c

In [60]:
pd.merge(df1,df2,on="key",how="inner")

   key value_x value_y
0    1       a       a
1    2       b       b

In [61]:
pd.merge(df1,df2,on="key",how="outer")

   key value_x value_y
0    1       a       a
1    2       b       b
2    3       c     NaN
3    4     NaN       c

In [62]:
pd.merge(df1,df2,on="key",how="left")

   key value_x value_y
0    1       a       a
1    2       b       b
2    3       c     NaN

In [63]:
pd.merge(df1,df2,on="key",how="right")

   key value_x value_y
0    1       a       a
1    2       b       b
2    4     NaN       c